HomeRent/modules/Tour/Admin/BookingController.php

           'month'=> date('m-Y',$current_month + MONTH_IN_SECONDS)
        ]));

        $tour_categories = TourCategory::where('status', 'publish')->get()->toTree();
---
select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null