HomeRent/modules/Tour/Admin/TourController.php

select * from `bravo_tour_category` where `bravo_tour_category`.`id` in (5, 6) and `bravo_tour_category`.`deleted_at` is null
select * from `users` where `users`.`id` in (1, 6) and `users`.`deleted_at` is null
select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $this->checkPermission('tour_view');
        $query = Tour::query() ;
        $query->orderBy('id', 'desc');
        if (!empty($tour_name = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $tour_name . '%');
            $query->orderBy('title', 'asc');
        }
        if (!empty($cate = $request->input('cate_id'))) {
            $query->where('category_id', $cate);
        }
        if ($this->hasPermission('tour_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('create_user', $author);
            }
        } else {
            $query->where('create_user', Auth::id());
        }
        $data = [
            'rows'               => $query->with(['getAuthor','category_tour'])->paginate(20),
            'tour_categories'    => TourCategory::where('status', 'publish')->get()->toTree(),
            'tour_manage_others' => $this->hasPermission('tour_manage_others'),
            'breadcrumbs'        => [
                [
                    'name' => __('Апартаменты'),
                    'url'  => 'admin/module/tour'
                ],
                [
                    'name'  => __('Все апартаменты'),
                    'class' => 'active'
                ],
            ]
        ];

select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
    public function create(Request $request)
    {
        $this->checkPermission('tour_create');
        if (!empty($request->input())) {
            $row = new Tour($request->input());
            if ($row->save()) {
                $this->saveTerms($row, $request);
                $row->saveMeta($request);
                $row->saveSEO($request);
                return redirect('admin/module/tour')->with('success', __('Апартамент создан!'));
            }
        } else {
            $row = new Tour();
            $row->fill([
                'status' => 'publish'
            ]);
        }
        $data = [
            'row'           => $row,
            'attributes'    => Attributes::where('service', 'tour')->get(),
            'tour_category' => TourCategory::where('status', 'publish')->get()->toTree(),

select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
    public function edit(Request $request, $id)
    {
        $this->checkPermission('tour_update');
        $row = Tour::find($id);
        if (empty($row)) {
            return redirect('admin/module/tour');
        }
        if (!$this->hasPermission('tour_manage_others')) {
            if ($row->create_user != Auth::id()) {
                return redirect('admin/module/tour');
            }
        }
        if (!empty($request->input())) {
            $row->fill($request->input());
            if ($row->save()) {
                $this->saveTerms($row, $request);
                $row->saveMeta($request);
                $row->saveSEO($request);
                return redirect('admin/module/tour/edit/'.$id)->with('success', __('Апартамент обновлен!'));
            }
        }
        $data = [
            'row'            => $row,
            "selected_terms" => $row->tour_term->pluck('term_id'),
            'attributes'     => Attributes::where('service', 'tour')->get(),
            'tour_category' => TourCategory::where('status', 'publish')->get()->toTree(),

delete from `bravo_tour_term` where `tour_id` = 18 and `term_id` not in ('8')
---
    public function saveTerms($row, $request)
    {
        $this->checkPermission('tour_manage_attributes');
        if (empty($request->input('terms'))) {
            TourTerm::where('tour_id', $row->id)->delete();
        } else {
            $term_ids = $request->input('terms');
            foreach ($term_ids as $term_id) {
                TourTerm::firstOrCreate([
                    'term_id' => $term_id,
                    'tour_id' => $row->id
                ]);
            }
            TourTerm::where('tour_id', $row->id)->whereNotIn('term_id', $term_ids)->delete();