HomeRent/modules/Page/Admin/PageController.php

    public function index(Request $request)
    {
        $page_name = $request->query('page');
        $datapage = new Page;
        if ($page_name) {
            $datapage = Page::where('title', 'LIKE', '%' . $page_name . '%');
        }
        $datapage = $datapage->orderBy('title', 'asc');
        $data = [
            'rows'        => $datapage->paginate(20),
            'breadcrumbs' => [
                [
                    'name' => __('Pages'),
                    'url'  => 'admin/module/page'
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ]
        ];
---
select * from `core_pages` where `core_pages`.`deleted_at` is null order by `title` asc limit 20 offset 0
select count(*) as aggregate from `core_pages` where `core_pages`.`deleted_at` is null

    public function edit(Request $request, $id)
    {
        $row = Page::find($id);
        if (empty($row)) {
            return redirect('admin/module/page');
        }
        if (!empty($request->input())) {
            $row->fill($request->input());
            if ($row->save()) {
                $row->saveSEO($request);
                return redirect('admin/module/page')->with('success', __('Страница обновлена!'));
            }
        }
        $data = [
            'row'         => $row,
            'templates'   => Template::orderBy('id', 'desc')->limit(100)->get(),
---
select * from `core_templates` order by `id` desc limit 100