HomeRent/modules/Booking/Models/Booking.php

    public function getMeta($key, $default = '')
    {
        //if(isset($this->cachedMeta[$key])) return $this->cachedMeta[$key];
        $val = DB::table('bravo_booking_meta')->where([
            'booking_id' => $this->id,
            'name'       => $key
        ])->first();
---
select * from `bravo_booking_meta` where (`booking_id` = 23 and `name` = 'person_types') limit 1

    public static function getTopCardsReport()
    {

        $res = [];
        $total_money = parent::where('status', '!=', 'draft')->sum('total');
        $total_booking = parent::where('status', '!=', 'draft')->count('id');
        $total_user = \App\User::where('status', '!=', 'blocked')->count('id');
---
select count(`id`) as aggregate from `users` where `status` != 'blocked' and `users`.`deleted_at` is null