HomeRent/app/Http/Controllers/UserController.php

    public function update(Request $request2){
        $user2 = User::find($request2->id);
        $user2->password=Hash::make($request2->password);
        $user2->verificationID=$request2->verificationID;
        $user2->save();
---
update `users` set `password` = 'y$DW0/VxrpMEoiG5BZAKJQ5edG21xQSmguemHkkdCm/ayjykK1Ihram', `verificationID` = 'salut', `users`.`updated_at` = '2020-06-06 13:31:35' where `id` = 8

    public function deleteUser(Request $req8){
        $user = User::find($req8->id);
        $user->delete();
---
delete from `users` where `id` = 17