HomeRent/modules/Review/Models/Review.php

select * from `bravo_review_meta` where `review_id` = 58
---
    public function getReviewMeta()
    {
        return ReviewMeta::where("review_id", $this->id)->get();