HomeRent/modules/Tour/Models/Tour.php

    public function saveMeta(\Illuminate\Http\Request $request)
    {
        $meta = TourMeta::where('tour_id', $this->id)->first();
---
select * from `bravo_tour_meta` where `tour_id` = 18 limit 1